BookList.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-05-26 日 11:00 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Books I Collected</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="wugouzi" />
</head>
<body>
<div id="content">
<h1 class="title">Books I Collected</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgf83b7d1">Model Theory <code>[0/5]</code></a></li>
<li><a href="#orgf28825c">Set Theory <code>[0/4]</code></a></li>
<li><a href="#org95ca636">Categorical Logic <code>[0/4]</code></a></li>
<li><a href="#org698c2a7">Lambda Calculus <code>[0/4]</code></a></li>
<li><a href="#org17cf9f0">Computability Theory <code>[0/0]</code></a></li>
<li><a href="#org04d4a12">Math <code>[0/13]</code></a></li>
<li><a href="#orgea6ebbb">Linguistics <code>[0/4]</code></a></li>
<li><a href="#orgf051cb7">Philosophy <code>[0/5]</code></a></li>
<li><a href="#org5e76b10">Logic Programming <code>[0/6]</code></a></li>
<li><a href="#orgc4a497c">Programming Language Theory <code>[0/6]</code></a></li>
<li><a href="#org540b741">Combinatorial Optimization <code>[0/6]</code></a></li>
<li><a href="#orga3fb604">Technique Books <code>[0/0]</code></a></li>
</ul>
</div>
</div>
<p>
I decide to clear up my books
</p>







<div id="outline-container-orgf83b7d1" class="outline-2">
<h2 id="orgf83b7d1">Model Theory <code>[0/5]</code></h2>
<div class="outline-text-2" id="text-orgf83b7d1">
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> Elisabeth Bouscaren: <i>Model Theory and Algebraic Geometry</i></li>
<li class="off"><code>[&#xa0;]</code> <p>
Katrin Tent, Martin Ziegler: <i>A Course in Model Theory</i>
</p>

<p>
Advanced
</p></li>
<li class="off"><code>[&#xa0;]</code> <p>
David Marker: <i>Model Theory: An Introduction</i>
</p>

<p>
Require some algebra knowledge. Concise.
</p></li>
<li class="off"><code>[&#xa0;]</code> <p>
C. C. Chang, H. J. Keisler: <i>Model Theory</i>
</p>

<p>
Classic reference.
</p></li>
<li class="off"><code>[&#xa0;]</code> Kees Doets: <i>Baisc Model Theory</i></li>
</ul>
</div>
</div>

<div id="outline-container-orgf28825c" class="outline-2">
<h2 id="orgf28825c">Set Theory <code>[0/4]</code></h2>
<div class="outline-text-2" id="text-orgf28825c">
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> Irving Kaplansky: <i>Set Theory and Metric Spaces</i></li>
<li class="off"><code>[&#xa0;]</code> Kenneth Kunen: <i>Set Theory</i></li>
<li class="off"><code>[&#xa0;]</code> <p>
Kerbert B. Enderton: <i>Elements of Set Theory</i>
</p>

<p>
I don't like this book's writing style. Maybe it's too old.
</p></li>
<li class="off"><code>[&#xa0;]</code> </li>
</ul>
</div>
</div>



<div id="outline-container-org95ca636" class="outline-2">
<h2 id="org95ca636">Categorical Logic <code>[0/4]</code></h2>
<div class="outline-text-2" id="text-org95ca636">
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> Bart Jacobs: <i>Categorical Logic and Type Theory</i></li>
<li class="off"><code>[&#xa0;]</code> Jonathan D. H. Smith, Anna B. Romanowska: <i>Post Modern ALgebra</i></li>
<li class="off"><code>[&#xa0;]</code> </li>

<li class="off"><code>[&#xa0;]</code> </li>
</ul>
</div>
</div>

<div id="outline-container-org698c2a7" class="outline-2">
<h2 id="org698c2a7">Lambda Calculus <code>[0/4]</code></h2>
<div class="outline-text-2" id="text-org698c2a7">
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> J. Roger Hindley, Jonathan P. Seldin:  <i>Lambda-Calculus and Combinators,
an Introduction</i></li>
<li class="off"><code>[&#xa0;]</code> </li>

<li class="off"><code>[&#xa0;]</code> </li>

<li class="off"><code>[&#xa0;]</code> </li>
</ul>
</div>
</div>

<div id="outline-container-org17cf9f0" class="outline-2">
<h2 id="org17cf9f0">Computability Theory <code>[0/0]</code></h2>
<div class="outline-text-2" id="text-org17cf9f0">
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> Michael R. Garey: <i>Computers and Intractability</i></li>
</ul>
</div>
</div>


<div id="outline-container-org04d4a12" class="outline-2">
<h2 id="org04d4a12">Math <code>[0/13]</code></h2>
<div class="outline-text-2" id="text-org04d4a12">
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> Sergei I. Gelfand, Yuri Manin: <i>Methods of Homological Algebra</i></li>
<li class="off"><code>[&#xa0;]</code> <p>
Robert Rosenbrugh, William Lawvere: <i>Sets for Mathematics</i>
</p>

<p>
It's interesting from table of contents.
</p></li>
<li class="off"><code>[&#xa0;]</code> <p>
Dominik Wodarz, Natalia L. Komarova: <i>Dynamics of Cancer: Mathematical</i>
<i>Foundations of Oncology</i>
</p>

<p>
TOC is interesting.
</p></li>
<li class="off"><code>[&#xa0;]</code> Bernhard Ganter, Gerd Stumme, Rudolf Wille(Eds.): <i>Formal Concept</i>
<i>Analysis, Foundations and Applications</i></li>
<li class="off"><code>[&#xa0;]</code> David Eisenbud: <i>Commutative Algebra with a View Toward Algebraic
Geometry</i></li>
<li class="off"><code>[&#xa0;]</code> Stanley Burris, H. P. Sankappanavar: <i>A course in Universal Algebra</i></li>
<li class="off"><code>[&#xa0;]</code> G. Grätzer: <i>Universal Algebra</i></li>
<li class="off"><code>[&#xa0;]</code> G. Grätzer: <i>Lattice Theory</i></li>
<li class="off"><code>[&#xa0;]</code> B. A. Davey, H. A. Priestley: <i>Introduction to Lattices and Order</i></li>
<li class="off"><code>[&#xa0;]</code> </li>

<li class="off"><code>[&#xa0;]</code> </li>

<li class="off"><code>[&#xa0;]</code> </li>
</ul>
</div>
</div>

<div id="outline-container-orgea6ebbb" class="outline-2">
<h2 id="orgea6ebbb">Linguistics <code>[0/4]</code></h2>
<div class="outline-text-2" id="text-orgea6ebbb">
<p>
Personally I don't like statistics though it's quite interesting
</p>
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> Patrick Blackburn, Johans Bos: <i>Representation and Inference for Natural
Language</i></li>
<li class="off"><code>[&#xa0;]</code> N. Zalta: <i>Principia Logico-Metaphysica</i></li>
<li class="off"><code>[&#xa0;]</code> </li>

<li class="off"><code>[&#xa0;]</code> </li>
</ul>
</div>
</div>

<div id="outline-container-orgf051cb7" class="outline-2">
<h2 id="orgf051cb7">Philosophy <code>[0/5]</code></h2>
<div class="outline-text-2" id="text-orgf051cb7">
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> Perter Van Inwagen: <i>Metaphysics</i></li>
<li class="off"><code>[&#xa0;]</code> Leon Horsten, Philip Welch: <i>Gödel's Disjunction: the scope and limits</i>
<i>of mathematical knowledge</i></li>
<li class="off"><code>[&#xa0;]</code> </li>

<li class="off"><code>[&#xa0;]</code> </li>

<li class="off"><code>[&#xa0;]</code> </li>
</ul>
</div>
</div>

<div id="outline-container-org5e76b10" class="outline-2">
<h2 id="org5e76b10">Logic Programming <code>[0/6]</code></h2>
<div class="outline-text-2" id="text-org5e76b10">
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> Ivan Bratko: <i>Prolog Programming for Artificial Intelligence</i></li>
<li class="off"><code>[&#xa0;]</code> Richard A. O'keefe: <i>The Craft of Prolog</i></li>
<li class="off"><code>[&#xa0;]</code> Melvin Fitting: <i>Computability Theory, Semantics, and Logic Programming</i></li>
<li class="off"><code>[&#xa0;]</code> Pascal Hitzler, Anthony Seda: <i>Mathematical Aspects of Logic Programming
Semantics</i></li>
<li class="off"><code>[&#xa0;]</code> </li>

<li class="off"><code>[&#xa0;]</code> </li>
</ul>
</div>
</div>

<div id="outline-container-orgc4a497c" class="outline-2">
<h2 id="orgc4a497c">Programming Language Theory <code>[0/6]</code></h2>
<div class="outline-text-2" id="text-orgc4a497c">
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> Zhaohui Luo: <i>Computation and Reasoning A Type Theory for Computer</i>
<i>Science</i></li>
<li class="off"><code>[&#xa0;]</code> Rober Harper: <i>Foundations for Programming Languages</i></li>
<li class="off"><code>[&#xa0;]</code> Carl A. Gunter: <i>Semantics of Programming Languages Structures and
Techniques</i></li>
<li class="off"><code>[&#xa0;]</code> John C. Reynolds: <i>Theories of Programming Languages</i></li>
<li class="off"><code>[&#xa0;]</code> J. Roger Hindley: <i>Basic Simple Type Theory</i></li>
<li class="off"><code>[&#xa0;]</code> </li>

<li class="off"><code>[&#xa0;]</code> <p>
Matthias Felleisen, Matthew Flatt: <i>Programming Languages and Lambda
Calculi</i> 
</p>

<p>
A lecture note.
</p></li>
</ul>
</div>
</div>

<div id="outline-container-org540b741" class="outline-2">
<h2 id="org540b741">Combinatorial Optimization <code>[0/6]</code></h2>
<div class="outline-text-2" id="text-org540b741">
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> Mark S. Daskin: <i>Network and Discrete Location: Models, Algorithms, and
Applications</i></li>
<li class="off"><code>[&#xa0;]</code> Ding-Zhu Du, Peng-Jun Wan: <i>Connected Dominating Set: Theory and
Applications</i></li>
<li class="off"><code>[&#xa0;]</code> James G. Oxley: <i>Matroid Theory</i></li>
<li class="off"><code>[&#xa0;]</code> Douglas B. West: <i>Introduction to Graph Theory</i></li>
<li class="off"><code>[&#xa0;]</code> </li>

<li class="off"><code>[&#xa0;]</code> </li>
</ul>
</div>
</div>

<div id="outline-container-orga3fb604" class="outline-2">
<h2 id="orga3fb604">Technique Books <code>[0/0]</code></h2>
<div class="outline-text-2" id="text-orga3fb604">
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> Daniel P. Bovet, Marco Cesati: <i>Understanding the Linux Kernel</i></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: wugouzi</p>
<p class="date">Created: 2019-05-26 日 11:00</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
